# Задание № 2
# Map, filter
# Есть такой список:
# temperatures = [20, 15, 32, 34, 21, 19, 25, 27, 30, 32, 34, 30, 29, 25, 27, 22, 22, 23, 25, 29, 29, 31, 33, 31, 30, 32, 30, 28, 24, 23]
# С помощью функции map или filter создайте из этого списка новый список с жаркими днями. Будем считать жарким всё, что выше 28.
# Распечатайте из нового списка самую высокую температуру самую низкую и среднюю.

temperatures = [20, 15, 32, 34, 21, 19, 25, 27, 30, 32, 34, 30, 29, 25, 27, 22, 22, 23, 25, 29, 29, 31, 33, 31, 30, 32,
                30, 28, 24, 23]

hot_days = list(filter(lambda x: x > 28, temperatures))
print(f" Список самых жарких дней - {hot_days}")

if hot_days:
    high_temp = max(hot_days)
    low_temp = min(hot_days)
    average_temp = sum(hot_days) / len(hot_days)
    print("Самая высокая температура - ", high_temp)
    print("Самая низкая температура - ", low_temp)
    print("Средняя температура - ", int(average_temp))
